IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_OTTOCAL2_CONTROLSS_OTTOCAL2.xml
<module name="CONTROLSS_OTTOCAL2_CONTROLSS_OTTOCAL2" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_OTTOCAL2_HRPWR" acronym="CONTROLSS_OTTOCAL2_HRPWR" offset="0x42" width="16" description="">
		<bitfield id="CALPWRON" width="1" begin="15" end="15" resetval="0x0" description="MEP Calibration Power Bits (only available on ePWM1)   0: Disables MEP calibration logic in the HRPWM and reduces power consumption.   1: Enables MEP calibration logic" range="15" rwaccess="RW"/> 
		<bitfield id="CALSEL" width="4" begin="9" end="6" resetval="0x0" description="EPWM Delay Line Selection for Calibration:" range="9 - 6" rwaccess="RW"/> 
		<bitfield id="TESTSEL" width="1" begin="5" end="5" resetval="0x0" description="Test Mode Select Bit: This bit selects if a dummy delay is added in Oscillator Calibration mode to help reducing frequency when small delays are used:" range="5" rwaccess="RW"/> 
		<bitfield id="CALSTS" width="1" begin="4" end="4" resetval="0x0" description="Calibration Status Bit: This bit, when set to 1, indicates that calibration is in progress. It is set to 0 when:" range="4" rwaccess="RO"/> 
		<bitfield id="CNTSEL" width="1" begin="3" end="3" resetval="0x0" description="Counter Select Bit: Functionality of this bit has changed. When HRCNT0 or HRCNT1 reaches 0xFFFF, both counters are frozen. This bit will have an effect on when calibration starts:" range="3" rwaccess="RW"/> 
		<bitfield id="CALSTART" width="1" begin="2" end="2" resetval="0x0" description="Calibration Start/Stop Bit:" range="2" rwaccess="RW"/> 
		<bitfield id="CALMODE" width="2" begin="1" end="0" resetval="0x0" description="Note: CALMODE bits in HRPWM Module. Not used here." range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OTTOCAL2_HRCAL" acronym="CONTROLSS_OTTOCAL2_HRCAL" offset="0x44" width="16" description="">
		<bitfield id="HRCAL" width="8" begin="7" end="0" resetval="0x0" description="These 8-bits are used to select the number of delay elements during oscillator calibration for the calibration delay line (DCAL) only. The user configures the desired delay and then initiates a calibration run. Based on the calibration run result, the delay is increased/decreased for the next calibration run." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OTTOCAL2_HRPRD" acronym="CONTROLSS_OTTOCAL2_HRPRD" offset="0x46" width="16" description="">
		<bitfield id="HRPRD" width="16" begin="15" end="0" resetval="0x0" description="These 8-bits are used to select the number of delay elements during oscillator calibration for the calibration delay line (DCAL) only." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OTTOCAL2_HRCNT0" acronym="CONTROLSS_OTTOCAL2_HRCNT0" offset="0x48" width="16" description="">
		<bitfield id="HRCNT0" width="16" begin="15" end="0" resetval="0x0" description="The HRCNT0 counter increments on every ring oscillator clock pulse." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OTTOCAL2_HRCNT1" acronym="CONTROLSS_OTTOCAL2_HRCNT1" offset="0x4A" width="16" description="">
		<bitfield id="HRCNT1" width="16" begin="15" end="0" resetval="0x0" description="The HRCNT1 counter increments on every system clock pulse." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OTTOCAL2_HRMSTEP" acronym="CONTROLSS_OTTOCAL2_HRMSTEP" offset="0x4C" width="16" description="">
		<bitfield id="HRMSTEP" width="8" begin="7" end="0" resetval="0x0" description="High Resolution MEP Step  When auto-conversion is enabled (HRCNFG[AUTOCONV] = 1), This 8-bit field contains the MEP_ScaleFactor (number of MEP steps per coarse steps) used by the hardware to automatically convert the value in the CMPAHR, CMPBHR, DBFEDHR, DBREDHR , TBPHSHR, or TBPRDHR register to a scaled micro-edge delay on the high-resolution ePWM output. The value in this register is written by the SFO calibration software at the end of each calibration run." range="7 - 0" rwaccess="RW"/>
	</register>
</module>